[
  { "id": 1, "category_hint": "familia", "text": "Se solicita la custodia del menor y la fijación de una cuota de alimentos acorde a los ingresos del padre." },
  { "id": 2, "category_hint": "familia", "text": "La madre solicita la regulación del régimen de visitas en favor del bienestar del menor." },
  { "id": 3, "category_hint": "familia", "text": "Demanda de divorcio por mutuo acuerdo con liquidación de la sociedad conyugal." },
  { "id": 4, "category_hint": "familia", "text": "Proceso de impugnación de la paternidad conforme a las pruebas genéticas aportadas." },
  { "id": 5, "category_hint": "familia", "text": "Solicitud de adopción cumpliendo los requisitos legales establecidos por la ley." },
  { "id": 6, "category_hint": "familia", "text": "Se pretende el aumento de la cuota alimentaria debido al cambio de condiciones económicas." },
  { "id": 7, "category_hint": "familia", "text": "Demanda para la pérdida de la patria potestad por abandono del menor." },
  { "id": 8, "category_hint": "familia", "text": "Proceso de separación de cuerpos con medidas provisionales sobre los hijos." },
  { "id": 9, "category_hint": "familia", "text": "Solicitud de custodia compartida garantizando la estabilidad emocional del menor." },
  { "id": 10, "category_hint": "familia", "text": "Revisión judicial del acuerdo de alimentos previamente aprobado." },

  { "id": 11, "category_hint": "laboral", "text": "El trabajador fue despedido sin justa causa y solicita el pago de indemnización." },
  { "id": 12, "category_hint": "laboral", "text": "Demanda por incumplimiento en el pago de salarios y prestaciones sociales." },
  { "id": 13, "category_hint": "laboral", "text": "Reclamación por acoso laboral que afectó la salud mental del trabajador." },
  { "id": 14, "category_hint": "laboral", "text": "Solicitud de reconocimiento de horas extras y recargos nocturnos." },
  { "id": 15, "category_hint": "laboral", "text": "Proceso laboral por terminación unilateral del contrato sin previo aviso." },
  { "id": 16, "category_hint": "laboral", "text": "Demanda para el pago de liquidación laboral adeudada por el empleador." },
  { "id": 17, "category_hint": "laboral", "text": "Reclamación por despido discriminatorio contrario a la ley." },
  { "id": 18, "category_hint": "laboral", "text": "Solicitud de reintegro laboral por fuero sindical." },
  { "id": 19, "category_hint": "laboral", "text": "Proceso por modificación unilateral de las condiciones de trabajo." },
  { "id": 20, "category_hint": "laboral", "text": "Demanda para el reconocimiento de pensión por invalidez laboral." },

  { "id": 21, "category_hint": "penal", "text": "El imputado fue capturado en flagrancia por el delito de hurto agravado." },
  { "id": 22, "category_hint": "penal", "text": "Audiencia de imputación de cargos por el delito de lesiones personales." },
  { "id": 23, "category_hint": "penal", "text": "Solicitud de medida de aseguramiento privativa de la libertad." },
  { "id": 24, "category_hint": "penal", "text": "Proceso penal por el delito de violencia intrafamiliar." },
  { "id": 25, "category_hint": "penal", "text": "Investigación penal adelantada por la fiscalía general de la nación." },
  { "id": 26, "category_hint": "penal", "text": "Juicio oral por el delito de homicidio agravado." },
  { "id": 27, "category_hint": "penal", "text": "Solicitud de preclusión de la investigación penal por falta de pruebas." },
  { "id": 28, "category_hint": "penal", "text": "Audiencia de legalización de captura conforme al debido proceso." },
  { "id": 29, "category_hint": "penal", "text": "Imposición de pena conforme a los criterios de proporcionalidad." },
  { "id": 30, "category_hint": "penal", "text": "Proceso penal por fraude y estafa agravada." },

  { "id": 31, "category_hint": "civil", "text": "Demanda por incumplimiento contractual y solicitud de indemnización de perjuicios." },
  { "id": 32, "category_hint": "civil", "text": "Proceso de responsabilidad civil extracontractual por daños causados." },
  { "id": 33, "category_hint": "civil", "text": "Acción para el reconocimiento de la propiedad por prescripción adquisitiva." },
  { "id": 34, "category_hint": "civil", "text": "Demanda de nulidad absoluta del contrato celebrado." },
  { "id": 35, "category_hint": "civil", "text": "Proceso civil para la restitución de inmueble arrendado." },
  { "id": 36, "category_hint": "civil", "text": "Reclamación por incumplimiento de obligaciones contractuales." },
  { "id": 37, "category_hint": "civil", "text": "Demanda por enriquecimiento sin causa." },
  { "id": 38, "category_hint": "civil", "text": "Proceso de cobro ejecutivo por obligación vencida." },
  { "id": 39, "category_hint": "civil", "text": "Acción civil para la reparación de daños materiales." },
  { "id": 40, "category_hint": "civil", "text": "Solicitud de resolución contractual por incumplimiento grave." },

  { "id": 41, "category_hint": "constitucional", "text": "Interposición de acción de tutela para la protección de derechos fundamentales." },
  { "id": 42, "category_hint": "constitucional", "text": "Tutela por vulneración al derecho fundamental a la salud." },
  { "id": 43, "category_hint": "constitucional", "text": "Acción de tutela por violación al debido proceso." },
  { "id": 44, "category_hint": "constitucional", "text": "Solicitud de amparo constitucional por discriminación." },
  { "id": 45, "category_hint": "constitucional", "text": "Tutela para garantizar el derecho a la educación." },
  { "id": 46, "category_hint": "constitucional", "text": "Protección del derecho fundamental a la igualdad." },
  { "id": 47, "category_hint": "constitucional", "text": "Revisión constitucional de una acción de tutela." },
  { "id": 48, "category_hint": "constitucional", "text": "Acción constitucional para proteger el mínimo vital." },
  { "id": 49, "category_hint": "constitucional", "text": "Tutela contra entidad pública por omisión administrativa." },
  { "id": 50, "category_hint": "constitucional", "text": "Solicitud de protección inmediata de derechos fundamentales vulnerados." }
]